{
    "type": "Collection",
    "id": "projects/gcp-public-data-weathernext/assets/59572747_4_0",
    "stac_version": "1.0.0",
    "description": "WeatherNext Graph is an experimental dataset of global medium-range weather\nforecasts produced by Google DeepMind's graphical neural network weather\nmodel.\n\nThe dataset includes real-time and historical forecasts. This includes major\natmospheric and surface fields including temperature, wind, precipitation,\nhumidity, geopotential, vertical velocity and pressure. The spatial\nresolution is 0.25 degrees and temporal resolution is 6 hours.\nInitialisation times are 00z, 06z, 12z, 18z. The data are 6 hour forecasts\nup to a max lead time of 10 days.\n\nThis dataset is not public. To access this data, please fill out this\n[request form](https://forms.gle/q8GATt5yr3rLJNrw5).\n\nMore information on the model is in \"[Learning skillful\nmedium-range global weather forecasting](https://www.science.org/stoken/author-tokens/ST-1550/full)\"\n",
    "links": [
        {
            "rel": "root",
            "href": "https://storage.googleapis.com/earthengine-stac/catalog/catalog.json",
            "type": "application/json",
            "title": "Google Earth Engine Catalog"
        },
        {
            "rel": "related",
            "href": "https://code.earthengine.google.com/?scriptPath=Examples:Datasets/gcp-public-data-weathernext/projects_gcp-public-data-weathernext_assets_59572747_4_0",
            "type": "text/html",
            "title": "Run the example for projects/gcp-public-data-weathernext/assets/59572747_4_0 in the Earth Engine Code Editor",
            "code": "JavaScript"
        },
        {
            "rel": "preview",
            "href": "https://developers.google.com/earth-engine/datasets/images/gcp-public-data-weathernext/projects_gcp-public-data-weathernext_assets_59572747_4_0_sample.png",
            "type": "image/png"
        },
        {
            "rel": "license",
            "href": "https://developers.google.com/earth-engine/datasets/catalog/projects_gcp-public-data-weathernext_assets_59572747_4_0#terms-of-use",
            "type": "text/html"
        },
        {
            "rel": "self",
            "href": "https://storage.googleapis.com/earthengine-stac/catalog/gcp-public-data-weathernext/projects_gcp-public-data-weathernext_assets_59572747_4_0.json",
            "type": "application/json"
        },
        {
            "rel": "parent",
            "href": "https://storage.googleapis.com/earthengine-stac/catalog/gcp-public-data-weathernext/catalog.json",
            "type": "application/json",
            "title": "gcp-public-data-weathernext"
        }
    ],
    "stac_extensions": [
        "https://stac-extensions.github.io/eo/v1.0.0/schema.json",
        "https://stac-extensions.github.io/scientific/v1.0.0/schema.json"
    ],
    "gee:status": "beta",
    "gee:terms_of_use": "This repository contains weather forecasting research data produced by Google DeepMind's machine learning models.\n\nAny data that relates to a time that is:\n\n*   no more than 48 hours in the past is made available under the [link - GDM's Real-Time Weather Forecasting Research Data Terms of Use]\n\n*   more than 48 hours ago is licensed under the [link - Creative Commons Attribution-Non-Commercial ShareAlike International License, Version 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/deed.en) (CC-BY-NC-SA 4.0).\n\n\nIf you have any questions on using this weather forecasting research data, or would like to use it for purposes not currently permitted under these terms, please contact gencast-contact@google.com.\n\nGDM REAL-TIME WEATHER FORECASTING RESEARCH DATA TERMS OF USE\n\n**Last modified: 26 November 2024**\n\nBy using, reproducing, modifying, performing, distributing or displaying all or any portion of the Real-Time Research Data (as defined below), or otherwise accepting these Terms, you agree to be bound by (1) these terms of use;\n\nand (2) [Google's Generative AI Prohibited Use Policy](https://policies.google.com/terms/generative-ai/use-policy) which is incorporated herein by reference (together, the \" Terms \"), in each case (a) as modified from time to time in accordance with the Terms, and (b) between you and (i) if you are from a country in the European Economic Area or Switzerland, Google Ireland Limited, or (ii) otherwise, Google LLC.\n\nIf you are accessing or using the Real-Time Research Data for or on behalf of a legal entity you represent and warrant that you have the authority to act on behalf of and bind that entity to these Terms.\n\nPlease read these Terms carefully. They establish what you can expect from us as you access and use the Real-Time Research Data, and what Google expects from you.\n\nWhen we say \" you\"  or  \"your\" , we mean the individual or legal entity using the Real-Time Research Data.\n\nWhen we say \" we \", \" us \" or \" Google \", we mean the entities that belong to the Google group of companies, which means Google LLC and its affiliates.\n\n**Section 1: Definitions and Interpretation**\n\nIn these Terms, unless the context indicates otherwise:\n\n(a)  Contractor  means a person or entity that enters a contract with you to provide services to you which require access to the Real-Time Research Data.\n\n(b)  Distribute  means controlled transmission or supply to clearly identified and known third party or third parties, including (for the avoidance of doubt) Contractors and Subsidiaries.\n\n(c)  Disseminate  means any act of making materials available publicly, or otherwise to any unknown third party or third parties, including any transmission, broadcast, supply, reproduction, publication or sharing.\n\n(d)   Educational Use  means any use (including controlled display or reproduction) of the Real-Time Research Data solely for educational non-commercial purposes, without Distribution, Dissemination or otherwise sharing to or by any third party, or use to generate VAS.\n\n(d)  End User  means clearly identified and known users who use the VAS for their own internal purposes, and do not further Distribute, Disseminate or otherwise share them or use them to generate VAS.\n\n(e)  including  means \"including without limitation\".\n\n(f)  Non-Retrievable VAS  means any VAS from which the Real-Time Research Data cannot be retrieved or reverse engineered without significant technical effort and/or expense.\n\n(g)   Real-Time   Research   Data  means the meteorological research information generated by Google and made available at [link] that relates to a time that is no more than 48 hours in the past.\n\n(h)  Restricted Country  means Japan, South Korea, Indonesia, Cuba, Iran, North Korea, Syria, Crimea and the so-called Donetsk People's Republic and Luhansk People's Republic.\n\n(i)  Retrievable VAS  means any VAS from which the Real-Time Research Data can be retrieved or reverse engineered without significant technical effort and/or expense.\n\n(j)  Subsidiary  means any of your subsidiaries which are directly controlled by you by means of you holding the majority of the voting rights.\n\n(k)   Value Added Service or VAS  means:\n\n(i)  any product, service, graphic, visualisation or other material that is derived from or based upon the Real-Time Research Data ( Service );\n\nand\n\n(ii)  created for a specific purpose or use case that cannot be achieved by utilising the Real-Time Research Data separate from the Service.\n\nFor the avoidance of doubt, the following do not constitute VAS:\n\n(i)   a product or service that merely allows for the access to, or download or retrieval of, unmodified Real-Time Research Data such as web, file or peer-to-peer sharing or hosting, or sharing via email, VPN, social media or API;\n\nor\n\n(ii)   material resulting from the colouring, formatting, compressing, fixed or arbitrary percentage adjustment, geometric transformation, sub-setting of areas, or custom combinations of time-steps, parameters or model runs of Real-Time Research Data.\n\nSuch material is considered unmodified Real-Time Research Data for the purposes of these Terms.\n\n**Section 2: Accessing and using the Real-Time Research Data**\n\n2.1  Eligibility\n\nYou represent and warrant that: (a) you have the legal capacity to enter into these Terms (including being of sufficient age of consent);\n\n(b) entering into or performing your rights or obligations under these Terms will not violate any agreement you have with a third party or any third-party rights;\n\n(c) any information provided by you to Google in relation to these Terms, including in order to request access to the Real-Time Research Data, is correct and current;\n\nand (d) you are not (i) resident of a Restricted Country, (ii) ordinarily resident in a Restricted Country, or (iii) otherwise prohibited by applicable export controls, sanctions programs or legal restrictions from accessing, using, or modifying the Real-Time Research Data.\n\n2.2   Use\n\n(a)  Subject to your compliance with these Terms, you may access, use and modify the Real-Time Research Data for any purpose, and Distribute and Disseminate this as set out in Section 3. We grant you a non-exclusive, royalty-free, revocable, non-transferable and non-sublicensable (except as expressly permitted in these Terms) license to any intellectual property rights we have in the Real-Time Research Data to the extent necessary for these purposes.\n\nIn order to verify your access and use of the Real-Time Research Data, we may from time-to-time ask for additional information from you, including verification of your name, legal entity, and other identifying information.\n\n**Section 3: Distribution, Dissemination and Use Restrictions**\n\n3.1   Distribution and Dissemination\n\n(a)  You may only Distribute:\n\n(i)  (and Disseminate) Non-Retrievable VAS;\n\n(ii)   Retrievable VAS to End-Users, along with any element or portion of the Real-Time Research Data strictly required for the Retrievable VAS to work or be correctly interpreted by such End-Users;\n\nor\n\n(iii)  Real-Time Data for:\n\n(I) Educational Use; and\n\n(II) your Contractors and Subsidiaries to use in accordance with these Terms.\n\n(b)  In addition to complying with Section 3.1(a), any Distribution of Real-Time Research Data or Retrievable VAS must be accompanied by:\n\n(i)  a copy of these Terms;\n\n(ii)   a \" Legally Binding Terms of Use\"  text file that contains the following notice: \" By using this information, you agree to the Terms of Use found at [link] \";\n\n(iii)  a prominent copyright notice:  \"Copyright 2024 DeepMind Technologies Limited\";  and\n\n(iv)   notice of any modifications that you make.\n\n(c)  You must not provide any additional or different provisions relating to use of Real-Time Research Data or Retrievable VAS that conflict with these Terms.\n\n3.2   Use Restrictions\n\n(a)  You must not use the Real-Time Research Data or VAS:\n\n(i)  in a manner that contravenes or contradicts these Terms, including for any restricted uses set out in [Google's Generative AI Prohibited Use Policy](https://policies.google.com/terms/generative-ai/use-policy);\n\n(ii)   in a Restricted Country, including: (I) if you are currently or ordinarily resident in a Restricted Country;\n\nor (II) by otherwise making these available in a Restricted Country; or\n\n(iii)  in violation of applicable laws and regulations.\n\n(b)  To the maximum extent permitted by law and without limiting any of our other rights, Google reserves the right to restrict usage of the Real-Time Research Data or VAS that Google reasonably believes are in violation of these Terms.\n\n3.3   Citation\n\nIf you disclose findings arising from the Real-Time Research Data or Distribute Non-Retrievable VAS, you must cite \" © 2024 DeepMind Technologies Limited's machine learning models used to create the research data made available at [link] under the following licence terms [link].\n\nThis data is intended for research modelling only and is not intended, validated, or approved for real world use .\n\n\"\n\n3.4  VAS\n\nSubject to any intellectual property rights Google has in the Real-Time Research Data, Google will not claim ownership of any VAS.\n\nHowever, you acknowledge that Google may develop its own VAS and it reserves all rights to do so.\n\n**Section 4: Changes to the Real-Time Research Data or these Terms**\n\n4.1  Google reserves its right to add or remove functionalities or features of, discontinue or limit the availability of, or otherwise update the Real-Time Research Data at its sole discretion.\n\nGoogle will endeavour to give you reasonable notice prior to any such changes.\n\n4.2  Google may update these Terms and the access mechanism for the Real-Time Research Data at any time.\n\nWe will post any modifications to these Terms [on this page - link].\n\nChanges will generally become effective 14 days after they are posted.\n\nHowever, changes addressing functionality or made for legal reasons will be effective immediately.\n\n4.3  Google does not currently levy a charge for your access to the Real-Time Research Data.\n\nHowever, Google reserves the right to charge reasonable fees for access to the Real-Time Research Data on providing you with at least one month's prior written notice and publishing the applicable fees at [insert link].\n\nWhere Google introduces fees, your use of the Real-Time Research Data will be subject to payment of the applicable fees.\n\nIf you do not wish to pay the fees, you must stop using the Real-Time Research Data immediately.\n\n4.4   You should review these Terms whenever we update them or whenever you use the Real-Time Research Data.\n\nIf you do not agree to any modified provisions in these Terms, you must stop using the Real-Time Research Data immediately.\n\n4.5   If, in accordance with this Section 4, Google discontinues or limits the availability of the Real-Time Research Data, changes these Terms or charges fees for access, you may continue to provide VAS based on or derived from the Real-Time Research Data accessed prior to this change in accordance with the version of the Terms that applied at the time of access and utilise copies of the Real-Time Research Data accessed prior to this change for this purpose, subject in all cases to the provisions in Section 5.  Section 5: Suspending or terminating your right to use the\n\n**Real-Time Research Data**\n\n5.1  Google may at any time suspend or terminate your right to use and, as applicable, your access to the Real-Time Research Data because of (among other serious grounds) your failure to comply with these Terms.\n\n5.2  If Google terminates your rights to use the Real-Time Research Data in accordance with Section 5.1 above, you:\n\n(a)  must delete and cease any use (including Distribution and Dissemination) of Real-Time Research Data and VAS in your possession or control;\n\n(b)   must notify all third party recipients of VAS that you no longer have the right to provide VAS to them and that they must cease use of VAS;\n\nand\n\n(c)  are prohibited from submitting another application to use the Real-Time Research Data.\n\n5.3  You are free to stop using the Real-Time Research Data at any time.\n\nIf you do stop using the Real-Time Research Data, we'd appreciate knowing why (via [add alias]) so that we can continue to improve our technologies.\n\n**Section 6: Disclaimers and Liability**\n\n6.1  Disclaimers\n\n(a)  Nothing in these Terms restricts any rights that cannot be restricted under applicable law or limits Google's responsibilities except as allowed by applicable law.\n\n(b)   The Real-Time Research Data is provided on an \"as is\" basis, without warranties or conditions of any kind, either express or implied, including any warranties or conditions of title, non-infringement, merchantability, or fitness for a particular purpose.\n\nYou are solely responsible for determining the appropriateness of accessing, using or modifying the Real-Time Research Data, or accessing, using, creating, Distributing or Disseminating any VAS and assume any and all risks associated with such use or distribution and your exercise of rights and obligations under these Terms.\n\nYou and anyone you share VAS with are solely responsible for these and their subsequent uses.\n\n(c)  The Real-Time Research Data contains predictions generated using Google's machine learning models as part of an experimental research project.\n\nThe Real-Time Research Data (i) is not based on data published by; (ii) has not been produced in collaboration with;\n\nand (iii) has not been endorsed by any government meteorological agency or department and in no way replaces official alerts, warnings or notices published by such agencies or departments.\n\n(d)  You will not make any representation to any third party concerning the Real-Time Data (including as to its accuracy) which are components of the Value-Added Services that are incompatible with these Terms.\n\n(e)  Nothing in these Terms constitutes or may be construed as permission to assert or imply that you or your Value-Added Services, or that your use of the Real-Time Research Data, are in any way sponsored, endorsed, or granted official status by Google or any meteorological agency or department and you will not claim or imply the same to any third party.\n\n6.2  Liabilities\n\n(a)  If you are a legal entity, to the extent allowed by applicable law, you'll indemnify Google and its directors, officers, employees, affiliates and contractors for any third-party legal proceedings (including actions by government authorities) arising out of or relating to your unlawful use of the Real-Time Research Data or VAS or violation of these Terms.\n\nThis indemnity covers any liability or expense arising from claims, losses, damages, judgments, fines, litigation costs, and legal fees, except to the extent a liability or expense is caused by Google's or its affiliates' breach, negligence, or willful misconduct.\n\nIf you're legally exempt from certain responsibilities, including indemnification, then those responsibilities don't apply to you under these Terms.\n\n(b)   In no event will Google or its affiliates be liable to you for any losses, costs, expenses or damages, including any direct, indirect, consequential, exemplary, or punitive damages or loss of profits of any kind arising out of or in relation to these Terms or use of the Real-Time Research Data or Distribution of any VAS, regardless of whether Google or its affiliates have been advised of the possibility of such damages, and regardless of whether such damages arise under contract, tort (including negligence), product liability, or otherwise.\n\nGoogle's and its affiliates' total, aggregate liability for all claims arising out of or in connection with these Terms, the Real-Time Research Data or any VAS, including for its own negligence, is limited to USD 500.\n\n**Section 7: Additional Provisions**\n\n7.1   Feedback\n\nIf you choose to give Google feedback, such as suggestions to improve the Real-Time Research Data or Google's machine learning models used to generate the Real-Time Research Data, you undertake any such information is non-confidential and non-proprietary, and Google may act on your feedback without obligation to you.\n\nYou grant Google a non-exclusive, transferable, sub-licensable, perpetual, irrevocable, royalty-free licence to use any intellectual property rights in the feedback for any purpose.\n\n7.2  Trademarks\n\nNothing in these Terms grants you any rights to use Google's trade marks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between you and Google.\n\n7.3  Governing Law and Jurisdiction\n\nCalifornia law will govern all disputes arising out of or relating to these Terms, regardless of any conflict of laws rules and each party agrees to the exclusive jurisdiction of Santa Clara County, California, USA.\n\nTo the extent that applicable local law prevents certain disputes from being resolved in a California court, you and Google can file those disputes in your local courts.\n\nIf applicable local law prevents your local court from applying California law to resolve these disputes, then these disputes will be governed by the applicable local laws of your country, state, or other place of residence.\n\n7.4  Severability\n\nIf any provision of these Terms is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.\n\n7.5  Entire Agreement\n\n(a)  These Terms state all the terms agreed between you and Google and supersede all other agreements relating to their subject matter as of the date of acceptance of these Terms.\n\n(b)  Google will not be bound by any additional terms or conditions communicated by you, unless expressly agreed in writing.\n\n7.6  No Waiver\n\nGoogle will not be treated as having waived any rights by not exercising (or delaying the exercise of) any rights under these Terms.\n\n7.7  Reservation of Rights\n\n(a)  Nothing in these Terms affects any rights that Google may have as a matter of law.\n\nNothing in these Terms will prevent Google from seeking any injunctive or equitable relief with respect to a breach (or anticipated breach) of these Terms.\n\n(b)  Nothing in these Terms will prevent you from exercising a right in relation to the Real-Time Research Data or VAS which cannot be excluded or limited as a matter of applicable law.\n",
    "gee:type": "image_collection",
    "gee:unusual_terms_of_use": true,
    "gee:user_uploaded": true,
    "sci:citation": "Lam, R., Sanchez-Gonzalez, A., Willson, M., Wirnsberger, P., Fortunato, M., Pritzel, A., Ravuri, S., Ewalds, T., Alet, F., Eaton-Rosen, Z., Hu, W., Merose, A., Hoyer, S., Holland, G., Stott, J., Vinyals, O., Mohamed, S., & Battaglia, P. (2022). GraphCast: Learning skillful medium-range global weather forecasting\n",
    "title": "WeatherNext Graph Forecasts",
    "extent": {
        "spatial": {
            "bbox": [
                [
                    -180,
                    -90,
                    180,
                    90
                ]
            ]
        },
        "temporal": {
            "interval": [
                [
                    "2020-01-01T00:00:00Z",
                    "2024-11-29T12:00:00Z"
                ]
            ]
        }
    },
    "license": "proprietary",
    "keywords": [
        "weather",
        "weathernext",
        "forecast",
        "temperature",
        "precipitation",
        "wind"
    ],
    "providers": [
        {
            "name": "Google",
            "roles": [
                "licensor",
                "producer"
            ],
            "url": "https://deepmind.google/discover/blog/graphcast-ai-model-for-faster-and-more-accurate-global-weather-forecasting/"
        },
        {
            "name": "Google Earth Engine",
            "roles": [
                "host"
            ],
            "url": "https://developers.google.com/earth-engine/datasets/catalog/projects_gcp-public-data-weathernext_assets_59572747_4_0"
        }
    ],
    "summaries": {
        "gee:schema": [
            {
                "description": "The initialization time of the forecast. This is the same for all\nforecast hours within a single model run.\n",
                "name": "start_time",
                "type": "STRING"
            },
            {
                "description": "The valid time for this specific forecast. Calculated as\nstart_time + forecast_hour\n",
                "name": "end_time",
                "type": "STRING"
            },
            {
                "description": "The forecast lead time in hours. Represents the number of hours from\nthe start_time.\n",
                "name": "forecast_hour",
                "type": "INT"
            },
            {
                "description": "The time when this forecast data became available in Earth Engine.\n",
                "name": "ingestion_time",
                "type": "DOUBLE"
            }
        ],
        "gee:visualizations": [
            {
                "display_name": "Temperature 2m",
                "image_visualization": {
                    "band_vis": {
                        "bands": [
                            "2m_temperature"
                        ],
                        "max": [
                            350
                        ],
                        "min": [
                            220
                        ],
                        "palette": [
                            "darkblue",
                            "blue",
                            "cyan",
                            "green",
                            "yellow",
                            "orange",
                            "red",
                            "darkred"
                        ]
                    }
                },
                "lookat": {
                    "lat": 52.48,
                    "lon": 71.72,
                    "zoom": 1
                }
            }
        ],
        "gsd": [
            27750
        ]
    }
}