{
    "type": "Collection",
    "id": "USDA/WRC/v0",
    "stac_version": "1.0.0",
    "description": "This dataset depicts components of wildfire risk for all lands in the United\nStates that: 1) are landscape-wide (i.e., measurable at every pixel across \nthe landscape); and 2) represent in situ risk - risk at the location where\nthe adverse effects take place on the landscape.\n\nNational wildfire hazard datasets of annual burn probability and fire\nintensity, generated by the USDA Forest Service, Rocky Mountain Researc\nStation and Pyrologix LLC, form the foundation of the Wildfire Risk to\nCommunities data. Vegetation and wildland fuels data from LANDFIRE 2020\n(version 2.2.0) were used as input to two different but related geospatial\nfire simulation systems. Annual burn probability was produced with the USFS\ngeospatial fire simulator (FSim) at a relatively coarse cell size of 270\nmeters (m). The burn probability raster data was upsampled to the native\n30 m resolution of the LANDFIRE fuel and vegetation data, to bring the data\ndown to a finer resolution more useful for assessing hazard and risk to\ncommunities. In this upsampling process, the provider also spread values of\nmodeled burn probability into developed areas represented in LANDFIRE fuels\ndata as non-burnable.\n\nBurn probability rasters represent landscape\nconditions as of the end of 2020. Fire intensity characteristics were\nmodeled at 30 m resolution using a process that performs a comprehensive\nset of FlamMap runs spanning the full range of weather-related\ncharacteristics that occur during a fire season and then integrates those\nruns into a variety of results based on the likelihood of those weather\ntypes occurring. Before the fire intensity modeling, the LANDFIRE 2020 data\nwere updated to reflect fuels disturbances occurring in 2021 and 2022. As\nsuch, the fire intensity datasets represent landscape conditions as of the\nend of 2022. Additional methodology documentation is available on USDA's \n[website](https://www.fs.usda.gov/rds/archive/catalog/RDS-2020-0016-2).\n\n",
    "links": [
        {
            "rel": "root",
            "href": "https://storage.googleapis.com/earthengine-stac/catalog/catalog.json",
            "type": "application/json",
            "title": "Google Earth Engine Catalog"
        },
        {
            "rel": "related",
            "href": "https://code.earthengine.google.com/?scriptPath=Examples:Datasets/USDA/USDA_WRC_v0",
            "type": "text/html",
            "title": "Run the example for USDA/WRC/v0 in the Earth Engine Code Editor",
            "code": "JavaScript"
        },
        {
            "rel": "preview",
            "href": "https://developers.google.com/earth-engine/datasets/images/USDA/USDA_WRC_v0_sample.png",
            "type": "image/png"
        },
        {
            "rel": "license",
            "href": "https://developers.google.com/earth-engine/datasets/catalog/USDA_WRC_v0#terms-of-use",
            "type": "text/html"
        },
        {
            "rel": "self",
            "href": "https://storage.googleapis.com/earthengine-stac/catalog/USDA/USDA_WRC_v0.json",
            "type": "application/json"
        },
        {
            "rel": "parent",
            "href": "https://storage.googleapis.com/earthengine-stac/catalog/USDA/catalog.json",
            "type": "application/json",
            "title": "USDA"
        }
    ],
    "stac_extensions": [
        "https://stac-extensions.github.io/eo/v1.0.0/schema.json",
        "https://stac-extensions.github.io/scientific/v1.0.0/schema.json"
    ],
    "gee:status": "beta",
    "gee:terms_of_use": "Data publications are made freely available to the public under our data\nuse agreement outlining conditions of use such as redistribution,\ncitation, notification, and distribution liability. The \n[Open Access - Data Use Agreement](https://www.fs.usda.gov/rds/archive/datauseinfo/open)\nis implicitly agreed to by anyone acquiring data from this repository.\nFormally, Archive-published datasets are released under the Creative Commons\nCC-BY license structure. This allows for broad use and re-use, while\npreserving the expectation of citation of the data publication to document\nthat use and credit the intellectual work of the author(s).\n\n",
    "gee:type": "image_collection",
    "sci:citation": "Scott, Joe H.; Dillon, Gregory K.; Jaffe, Melissa R.; Vogler, Kevin C.;\nOlszewski, Julia H.; Callahan, Michael N.; Karau, Eva C.; Lazarz,\nMitchell T.; Short, Karen C.; Riley, Karin L.; Finney, Mark A.; Grenfell,\nIsaac C. 2024. Wildfire Risk to Communities: Spatial datasets of\nlandscape-wide wildfire risk components for the United States. 2nd Edition.\nFort Collins, CO: Forest Service Research Data Archive.\n[doi:10.2737/RDS-2020-0016-2](https://doi.org/10.2737/RDS-2020-0016-2)\n\n",
    "sci:doi": "10.2737/RDS-2020-0016-2",
    "title": "Wildfire Risk to Communities v0",
    "extent": {
        "spatial": {
            "bbox": [
                [
                    -180,
                    -67.933,
                    18.854,
                    63.904
                ]
            ]
        },
        "temporal": {
            "interval": [
                [
                    "2020-12-31T00:00:00Z",
                    "2022-12-31T00:00:00Z"
                ]
            ]
        }
    },
    "license": "CC-BY-4.0",
    "keywords": [
        "fire",
        "wildfire",
        "burn",
        "usda"
    ],
    "providers": [
        {
            "name": "USDA Forest Service Research Data Archive",
            "roles": [
                "licensor",
                "producer"
            ],
            "url": "https://www.fs.usda.gov/rds/archive/"
        },
        {
            "name": "Google Earth Engine",
            "roles": [
                "host"
            ],
            "url": "https://developers.google.com/earth-engine/datasets/catalog/USDA_WRC_v0"
        }
    ],
    "summaries": {
        "eo:bands": [
            {
                "description": "Annual Burn Probability.",
                "name": "BP"
            },
            {
                "description": "Conditional Flame Length; mean flame length for fire burning in direction of maximum spread if a fire were to occur. Avg. measure of wildfire intensity.",
                "gee:units": "ft",
                "name": "CFL"
            },
            {
                "description": "Conditional Risk to Potential Structures; potential consequences of fire to a home at a given location, if a fire occurs there and if a home were located there.",
                "name": "CRPS"
            },
            {
                "description": "Measure of how exposed a housing unit would be to wildfire. A value of 1 is \"direct\" exposure. Values between 0 and 1 represent \"indirect\" exposure, with higher values representing closer proximity to directly exposed areas",
                "name": "Exposure"
            },
            {
                "description": "Flame Length Exceedance Probability - 4 ft; conditional probability that flame length at a pixel will exceed 4 feet if a fire occurs; indicates the potential for moderate to high wildfire intensity.",
                "name": "FLEP4"
            },
            {
                "description": "Farm Length Exceedance Probability - 8 ft; conditional probability that flame length at a pixel will exceed 8 feet if a fire occurs; indicates the potential for high wildfire intensity.",
                "name": "FLEP8"
            },
            {
                "description": "Risk to Potential Structures; relative risk to a house if one existed at that location.",
                "name": "RPS"
            },
            {
                "description": "Wildfire Hazard Potential index.",
                "name": "WHP"
            }
        ],
        "gee:visualizations": [
            {
                "display_name": "Annual burn probability",
                "image_visualization": {
                    "band_vis": {
                        "bands": [
                            "BP"
                        ],
                        "max": [
                            0.14
                        ],
                        "min": [
                            0
                        ]
                    }
                },
                "lookat": {
                    "lat": 40.7278,
                    "lon": -73.9958,
                    "zoom": 15
                }
            }
        ],
        "gsd": [
            30
        ],
        "BP": {
            "minimum": 0,
            "maximum": 0.14
        },
        "CFL": {
            "minimum": 0,
            "maximum": 861.7
        },
        "CRPS": {
            "minimum": 0,
            "maximum": 100
        },
        "Exposure": {
            "minimum": 0,
            "maximum": 1
        },
        "FLEP4": {
            "minimum": 0,
            "maximum": 1
        },
        "FLEP8": {
            "minimum": 0,
            "maximum": 1
        },
        "RPS": {
            "minimum": 0,
            "maximum": 13.2
        },
        "WHP": {
            "minimum": 0,
            "maximum": 99.853
        }
    }
}